In [1]:
import numpy as np
import pandas as pd

In [2]:
goods = pd.DataFrame({'price': [35,35,350,90,150,170,34,78],
                      'date':['2020-02-17',
                              '2020-03-17',
                              '2020-03-20',
                              '2020-05-01',
                              '2020-06-05',
                              '2020-05-05',
                              '2020-07-10',
                              '2020-09-15',],
                      'name':['ball','mouse','chair','dress','table','table','fork','dishes']})

In [3]:
goods['date']=pd.to_datetime(goods['date'])

In [77]:
goods

   price       date    name
0     35 2020-02-17    ball
1     35 2020-03-17   mouse
2    350 2020-03-20   chair
3     90 2020-05-01   dress
4    150 2020-06-05   table
5    170 2020-05-05   table
6     34 2020-07-10    fork
7     78 2020-09-15  dishes

In [5]:
import pandasql

In [6]:
pandasql.sqldf('''
select * 
from goods
''', locals())

   price                        date    name
0     35  2020-02-17 00:00:00.000000    ball
1     35  2020-03-17 00:00:00.000000   mouse
2    350  2020-03-20 00:00:00.000000   chair
3     90  2020-05-01 00:00:00.000000   dress
4    150  2020-06-05 00:00:00.000000   table
5    170  2020-05-05 00:00:00.000000   table
6     34  2020-07-10 00:00:00.000000    fork
7     78  2020-09-15 00:00:00.000000  dishes

In [7]:
# Итоговый запрос: выведем цену товара 'table', соответствующую дате '2020-06-05'
# язык SQLite
pandasql.sqldf('''
select price 
from goods
where name = 'table' and
    date <= '2020-06-05 00:00:00.000000'
order by date desc limit 1
''', locals())

   price
0    150

In [102]:
# решение на pandas:
result = goods.sort_values(by=['date']).reset_index(drop=True)

In [104]:
result = result.loc[(np.where(goods['name']=='table'))][:]

In [105]:
#  le - меньше или равно
result = result.loc[result['date'].le('2020-06-05')]['price'].tail(1)

In [107]:
result

5    150
Name: price, dtype: int64